#_______________________________________________________________________________________________
# Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# import random

# while True:
#     try:
#         number = int(input("Введите число: "))
#         break
#     except:
#         print("Неправильный ввод, попробуйте снова")
        

# def random_number(num):
#     for i in range(num):
#         print(random.randint(10,99), end=' ')
        


# random_number(number)
#_______________________________________________________________________________________________

# Для натурального n создать словарь индекс-значение, состоящий
# из элементов последовательности 3n + 1.





#_______________________________________________________________________________________________

# Пользователь задаёт две строки. Определить количество вхождений одной строки в другой.